PANDAS

In [ ]:
# Pandas - is a python library used for working with data sets.
# It has functions for analysing, cleaning, exploring and manipulating data.
# Pandas allows to analyse big datas and make conclusions based on statistical theory.
# Pandas can clean messy data sets and make them readable and relevent.

In [3]:
import pandas as pd

In [2]:
# import a csv data by a link from online.
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [11]:
df.to_csv('titanic')    #to save as csv file in system.

In [5]:
df.head(10)  #get first 10 datas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [6]:
df.tail(5)  #get last 5 datas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
df.columns #get names of columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
df[['Age']] #to get specific columns      # df['Age']: Returns a Series (1-dimensional data).
                                          # df[['Age']]: Returns a DataFrame (2-dimensional data).
# The outer brackets ([]) indicate that you are selecting data from the DataFrame.
# The inner brackets (['Age']) ensure that the result is a DataFrame, even when selecting a single column.

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [9]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [10]:
df[['Age']][4:9] #to get specific rows

    Age
4  35.0
5   NaN
6  54.0
7   2.0
8  27.0

In [11]:
df[['Age','Ticket']][4:9] #to get some specific columns

    Age  Ticket
4  35.0  373450
5   NaN  330877
6  54.0   17463
7   2.0  349909
8  27.0  347742

In [12]:
df.dtypes  #to get data types in each cloumn

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [13]:
# Check for Missing Values (NaN)

print(df.isnull().sum()) 

# df.isnull() returns a DataFrame of the same shape as df, where each element is True if it is a missing value (NaN) and False otherwise.
# .sum() computes the sum of True values (treated as 1) for each column, effectively

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [15]:
df.describe() #to get count, mean, standard deviation(std) etc of numerical data

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [16]:
# The 25th percentile means 25% of the data is below this value.

# The 50th percentile means 50% of the data is below this value.

# The 75th percentile means 75% of the data is below this value.

In [17]:
print(df.describe())

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [18]:
df[['Age']].describe() #for a specific column

              Age
count  714.000000
mean    29.699118
std     14.526497
min      0.420000
25%     20.125000
50%     28.000000
75%     38.000000
max     80.000000

In [19]:
df[['Name','Sex','Ticket','Cabin','Embarked']]  #to get a data frame with specific columns only

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [20]:
# Rename column 
a =df.rename(columns={'Sex':'Gender'})
a

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
df.dtypes == 'obiect' #Checking columns with object/string data type(all with true)

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin          False
Embarked       False
dtype: bool

In [41]:
df.dtypes == 'float64'  #Checking columns with float data type(all with true)

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare            True
Cabin          False
Embarked       False
dtype: bool

In [43]:
df.dtypes[df.dtypes == 'float64'] #Filters the original dtypes Series to include only columns with the float64 data type

Age     float64
Fare    float64
dtype: object

In [45]:
df.dtypes[df.dtypes == 'float64'].index #Retrieves the index (column names) of the filtered Series. 
                                        # These are the names of the columns with float64 data type.

Index(['Age', 'Fare'], dtype='object')

In [47]:
df[df.dtypes[df.dtypes == 'float64'].index] #getting columns with data type float

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [49]:
df[df.dtypes[df.dtypes == 'int64'].index] #getting columns with data type integer

     PassengerId  Survived  Pclass  SibSp  Parch
0              1         0       3      1      0
1              2         1       1      1      0
2              3         1       3      0      0
3              4         1       1      1      0
4              5         0       3      0      0
..           ...       ...     ...    ...    ...
886          887         0       2      0      0
887          888         1       1      0      0
888          889         0       3      1      2
889          890         1       1      0      0
890          891         0       3      0      0

[891 rows x 5 columns]

In [51]:
# Create a new column with all elements 0 (any values can be given)
df['New']=0
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [53]:
# Create a new column with giving a specific location(eg; at 3)
df.insert(loc=3 , column='Food',value=5)
df

,PassengerId,Survived,Pclass,Food,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New
0,1,0,3,5,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,5,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,5,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,5,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,5,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,5,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,5,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,1,1,5,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,5,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [1]:
# Add a new row to a DataFrame

import pandas as pd

# Existing DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob'],
    'Age': [25, 30]
})

# New data
new_row = {'Name': 'Charlie', 'Age': 22}

# Add new row using loc
df.loc[len(df)] = new_row

print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22

In [3]:
# Using pd.concat()

# Create new row as a DataFrame
new_row_df = pd.DataFrame([{'Name': 'David', 'Age': 28}])

# Concatenate
df = pd.concat([df, new_row_df], ignore_index=True)

print(df)

# Use ignore_index=True with concat to reset the row numbers.
# Keys in new_row dictionary must match column names in the DataFrame.

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    David   28

In [55]:
df.drop('PassengerId', axis=1) #temporarily deleting a specific column

,Survived,Pclass,Food,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New
0,0,3,5,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,1,1,5,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,1,3,5,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,1,1,5,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,0,3,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,5,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,1,1,5,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,0,3,5,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,1,1,5,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,0,3,5,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [57]:
df.drop('PassengerId', axis=1, inplace = True) #permanantly deleting a specific column


# If you didn't make a backup or store the original and the code has already run, you cannot restore it unless you:
        # Restart the notebook/session and re-run earlier code
        # Or reload the data from the original source


# Function	    Default Behavior	          Can Make Permanent?
# insert()	    Modifies df directly	      Yes, in-place by default
# drop()	    Returns a new DataFrame	      Use inplace=True or assign

In [59]:
df.drop(3) #temporarily deleting row 3

,Survived,Pclass,Food,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New
0,0,3,5,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,1,1,5,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,1,3,5,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
4,0,3,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
5,0,3,5,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,5,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,1,1,5,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,0,3,5,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,1,1,5,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,0,3,5,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [63]:
df.drop(3, inplace = True) # permanently deleting row 3
df

,Survived,Pclass,Food,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New
0,0,3,5,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,1,1,5,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,1,3,5,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
4,0,3,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
5,0,3,5,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,5,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,1,1,5,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,0,3,5,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,1,1,5,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,0,3,5,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [100]:
a = df['Name'][0:10]

In [102]:
a

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [104]:
type(a)

pandas.core.series.Series

In [111]:
#changing index
I = ['a1','a2','a3','a4','a5','a6','a7','a8','a9','a10']
pd.Series(a, index=I)     #as data type is stored as series

a1     NaN
a2     NaN
a3     NaN
a4     NaN
a5     NaN
a6     NaN
a7     NaN
a8     NaN
a9     NaN
a10    NaN
Name: Name, dtype: object

In [113]:
pd.Series(list(a), index=I)

a1                               Braund, Mr. Owen Harris
a2     Cumings, Mrs. John Bradley (Florence Briggs Th...
a3                                Heikkinen, Miss. Laina
a4          Futrelle, Mrs. Jacques Heath (Lily May Peel)
a5                              Allen, Mr. William Henry
a6                                      Moran, Mr. James
a7                               McCarthy, Mr. Timothy J
a8                        Palsson, Master. Gosta Leonard
a9     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
a10                  Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [119]:
x= pd.Series([100,200,300,400,500], index = [1,2,3,4,5])
x

1    100
2    200
3    300
4    400
5    500
dtype: int64

In [121]:
y= pd.Series([600,700,800,900,1000], index = [1,2,3,4,5])
y

1     600
2     700
3     800
4     900
5    1000
dtype: int64

In [125]:
z = pd.concat([x,y]) #joining
z

1     100
2     200
3     300
4     400
5     500
1     600
2     700
3     800
4     900
5    1000
dtype: int64

In [127]:
z[3]

3    300
3    800
dtype: int64

In [131]:
x+y #adding

1     700
2     900
3    1100
4    1300
5    1500
dtype: int64

In [129]:
x*y #product

1     60000
2    140000
3    240000
4    360000
5    500000
dtype: int64

In [113]:
# making a column as index (temporary)
df.set_index('Name')

,Survived,Pclass,Food,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",0,3,5,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,5,female,38.0,1,0,PC 17599,71.2833,C85,C,0
"Heikkinen, Miss. Laina",1,3,5,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
"Allen, Mr. William Henry",0,3,5,male,35.0,0,0,373450,8.0500,NaN,S,0
"Moran, Mr. James",0,3,5,male,NaN,0,0,330877,8.4583,NaN,Q,0
...,...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",0,2,5,male,27.0,0,0,211536,13.0000,NaN,S,0
"Graham, Miss. Margaret Edith",1,1,5,female,19.0,0,0,112053,30.0000,B42,S,0
"Johnston, Miss. Catherine Helen ""Carrie""",0,3,5,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
"Behr, Mr. Karl Howell",1,1,5,male,26.0,0,0,111369,30.0000,C148,C,0
"Dooley, Mr. Patrick",0,3,5,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [117]:
# making a column as index (permanent)
df.set_index('Name', inplace = True)

In [121]:
# reseting index
df.reset_index()

,Name,Survived,Pclass,Food,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New
0,"Braund, Mr. Owen Harris",0,3,5,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,1,5,female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,"Heikkinen, Miss. Laina",1,3,5,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,"Allen, Mr. William Henry",0,3,5,male,35.0,0,0,373450,8.0500,NaN,S,0
4,"Moran, Mr. James",0,3,5,male,NaN,0,0,330877,8.4583,NaN,Q,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,"Montvila, Rev. Juozas",0,2,5,male,27.0,0,0,211536,13.0000,NaN,S,0
886,"Graham, Miss. Margaret Edith",1,1,5,female,19.0,0,0,112053,30.0000,B42,S,0
887,"Johnston, Miss. Catherine Helen ""Carrie""",0,3,5,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
888,"Behr, Mr. Karl Howell",1,1,5,male,26.0,0,0,111369,30.0000,C148,C,0
889,"Dooley, Mr. Patrick",0,3,5,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [123]:
# making a data frame from dictionary
d = {'key1':[1,2,3,4,5], 'key2':[6,7,8,9,10], 'key3':[11,12,13,14,15]}
d

{'key1': [1, 2, 3, 4, 5],
 'key2': [6, 7, 8, 9, 10],
 'key3': [11, 12, 13, 14, 15]}

In [125]:
pd.DataFrame(d)

   key1  key2  key3
0     1     6    11
1     2     7    12
2     3     8    13
3     4     9    14
4     5    10    15

In [137]:
df1 = pd.read_csv('https://raw.githubusercontent.com/sonwaneshivani/Data-Science-Learning/refs/heads/main/taxonomy.csv')

In [139]:
df1

    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency       NaN                   NaN
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[290 rows x 4 columns]

In [145]:
# clearing NaN (Not a Number)
df1.dropna(inplace = True) #permanently deleting rows with NaN

# df.drop_duplicates()     removing duplicate rows

In [147]:
df1

    taxonomy_id                          name parent_id           parent_name
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
5     101-02-03          Help Pay for Housing    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[279 rows x 4 columns]

In [155]:
df2 = pd.read_csv('https://raw.githubusercontent.com/sonwaneshivani/Data-Science-Learning/refs/heads/main/taxonomy.csv')

In [157]:
df2

    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency       NaN                   NaN
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[290 rows x 4 columns]

In [159]:
df2.dropna(axis=1,inplace = True) #permanently deleting columns with NaN

In [161]:
df2

    taxonomy_id                          name
0           101                     Emergency
1        101-01             Disaster Response
2        101-02                Emergency Cash
3     101-02-01             Help Pay for Food
4     101-02-02       Help Pay for Healthcare
..          ...                           ...
285   111-01-07              Workplace Rights
286      111-02                     Mediation
287      111-03                        Notary
288      111-04                Representation
289      111-05  Translation & Interpretation

[290 rows x 2 columns]

In [171]:
df3.fillna('good', inplace=True) #changing NaN with specific values.s
df3


# df.fillna(0)                             # Replace all missing with 0
# df['Speed'].fillna(df['Speed'].mean())   # Fill Speed column with mean


# df.ffill()                      # Forward fill (from previous row) (default axis=0) It goes column-wise and fills NaNs using values from above.
# df.ffill(axis=1)                # Row-wise forward fill. Fills missing values row-wise, from left to right across the columns.

                
# df.bfill()                               # Backward fill (from next row)
# df.bfill(axis=1)                         # Row-wise backward fill

    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency      good                  good
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[290 rows x 4 columns]

In [51]:
df.sort_values(by='Age', ascending=True) #to sort the rows of a DataFrame based on the values in one or more columns.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [53]:
# df.sort_values(by='Age', inplace=True) to Sort and update original DataFrame

In [55]:
df.sort_values(by='Age', ignore_index=True) #Reset index after sorting

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
1,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
2,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
3,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
4,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
887,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
888,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
889,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
890,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [57]:
# Sort by multiple columns
df.sort_values(by=['Age', 'Name']) #First sorts by Age then sorts by Name within each Age group

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
354,355,0,3,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C
495,496,0,3,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C
240,241,0,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S

In [5]:
# Filtering in Pandas

import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['NY', 'LA', 'NY', 'Chicago']
})

# Filter rows where Age > 30
filtered_df = df[df['Age'] > 30]
print(filtered_df)

print(type(filtered_df))

      Name  Age     City
2  Charlie   35       NY
3    David   40  Chicago
<class 'pandas.core.frame.DataFrame'>

In [7]:
# Multiple Conditions

# Age > 30 and City is 'NY'
df[(df['Age'] > 30) & (df['City'] == 'NY')]


# In Pandas, & and and cannot be used interchangeably. Here's why:

# df[(df['Age'] > 30) and (df['City'] == 'NY')]  # ❌ Error!
# and is only for single boolean values, not Pandas Series.

# Use | for OR instead of or

      Name  Age City
2  Charlie   35   NY

In [1]:
# Grouping in Pandas

import pandas as pd


data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Sales'],
    'Employee': ['A', 'B', 'C', 'D', 'E'],
    'Salary': [50000, 55000, 60000, 62000, 70000]
}
df = pd.DataFrame(data)

# Group by department and calculate mean salary
grouped = df.groupby('Department')['Salary'].mean()
print(grouped)

Department
HR       52500.0
IT       61000.0
Sales    70000.0
Name: Salary, dtype: float64

In [3]:
# Group by multiple columns

df.groupby(['Department', 'Employee'])['Salary'].sum()

Department  Employee
HR          A           50000
            B           55000
IT          C           60000
            D           62000
Sales       E           70000
Name: Salary, dtype: int64

In [5]:
# Using multiple aggregation functions

df.groupby('Department')['Salary'].agg(['mean', 'max', 'min'])

               mean    max    min
Department
HR          52500.0  55000  50000
IT          61000.0  62000  60000
Sales       70000.0  70000  70000

In [29]:
# Filtering groups

# Example: keep departments where avg salary > 60,000


x = df.groupby('Department').filter(lambda x: x['Salary'].mean() > 60000)

  Department Employee  Salary
2         IT        C   60000
3         IT        D   62000
4      Sales        E   70000


0    False
1    False
2     True
3     True
4     True
Name: Salary, dtype: bool

In [21]:
# Iterating through groups

for name, group in df.groupby('Department'):
    print("Department:", name)
    print(group, "\n")

Department: HR
  Department Employee  Salary
0         HR        A   50000
1         HR        B   55000

Department: IT
  Department Employee  Salary
2         IT        C   60000
3         IT        D   62000

Department: Sales
  Department Employee  Salary
4      Sales        E   70000

In [37]:
# pivot
# pivot restructures your data from long format → wide format.
# Syntax

# df.pivot(index='row_key', columns='column_key', values='cell_value')
    # index → becomes rows
    # columns → becomes new columns
    # values → fills the table

import pandas as pd

df = pd.DataFrame({
    'Day': ['Mon', 'Mon', 'Tue', 'Tue'],
    'Department': ['HR', 'IT', 'HR', 'IT'],
    'Salary': [100, 200, 110, 220]
})
print(df)

   Day Department  Salary
0  Mon         HR     100
1  Mon         IT     200
2  Tue         HR     110
3  Tue         IT     220

In [35]:
df.pivot(index='Day', columns='Department', values='Salary')


# If the same (index, column) pair appears more than once, pivot fails.
# To solve this, use pivot_table with aggregation:

    # df.pivot_table(index='Day', columns='Department', values='Salary', aggfunc='mean')

Department   HR   IT
Day
Mon         100  200
Tue         110  220

In [13]:
# Merging in Pandas

df1 = pd.DataFrame({
    'Employee': ['A', 'B', 'C'],
    'Department': ['HR', 'IT', 'Sales']
})

df2 = pd.DataFrame({
    'Employee': ['A', 'B', 'C'],
    'Salary': [50000, 60000, 70000]
})

merged = pd.merge(df1, df2, on='Employee')
print(merged)

  Employee Department  Salary
0        A         HR   50000
1        B         IT   60000
2        C      Sales   70000

In [15]:
# Types of Merge:
# You can control how the merge is done using the how argument:

# inner	      Default. Only matching keys in both
# outer	      All rows, fill missing with NaN
# left	      All rows from left, matching from right
# right	      All rows from right, matching from left

pd.merge(df1, df2, on='Employee', how='outer')

  Employee Department  Salary
0        A         HR   50000
1        B         IT   60000
2        C      Sales   70000

In [19]:
# The how Argument in pd.merge(): The how argument specifies how to handle keys that don’t match between two DataFrames.

df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'ID': [2, 3, 4],
    'Score': [85, 90, 95]
})
print(df1)
print('\n')
print(df2)

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie


   ID  Score
0   2     85
1   3     90
2   4     95

In [21]:
# how='inner' – Only matching rows from both

pd.merge(df1, df2, on='ID', how='inner')

# ➡️ Only IDs 2 and 3 exist in both → included.

   ID     Name  Score
0   2      Bob     85
1   3  Charlie     90

In [23]:
# how='outer' – All rows from both, NaN where no match

pd.merge(df1, df2, on='ID', how='outer')

# ➡️ Includes all IDs: 1, 2, 3, 4. Missing data filled with NaN.

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0
3   4      NaN   95.0

In [25]:
# how='left' – All from df1, matched from df2

pd.merge(df1, df2, on='ID', how='left')

# ➡️ All rows from df1 kept. If df2 doesn't have that ID (like 1), Score is NaN.

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0

In [29]:
# how='right' – All from df2, matched from df1

pd.merge(df1, df2, on='ID', how='right')

# ➡️ All rows from df2 are kept. If df1 doesn't have that ID (like 4), Name is NaN.

   ID     Name  Score
0   2      Bob     85
1   3  Charlie     90
2   4      NaN     95

In [7]:
# Convert Categorical Variables

# Methods:
# Label Encoding: Converts categories to numbers (e.g., Male → 0, Female → 1)
# One-Hot Encoding: Creates separate columns for each category

df = pd.DataFrame({
    'Condition': ['Storm', 'Calm', 'Storm', 'Calm']
})

# One-hot encoding
encoded = pd.get_dummies(df, columns=['Condition'])
print(encoded)

   Condition_Calm  Condition_Storm
0           False             True
1            True            False
2           False             True
3            True            False

In [21]:
# pd.get_dummies() output is showing True/False instead of 0/1.
# It's likely because the underlying data type is boolean (bool), 
# which still behaves numerically (True = 1, False = 0) — but is displayed as True/False.

# You can simply convert the dtype using .astype(int):

# One-hot encoding with dtype conversion
df = pd.DataFrame({
    'Condition': ['Storm', 'Calm', 'Storm', 'Calm']
})

# One-hot encoding
encoded = pd.get_dummies(df, columns=['Condition']).astype(int)
print(encoded)

   Condition_Calm  Condition_Storm
0               0                1
1               1                0
2               0                1
3               1                0

In [9]:
# Label Encoding (Ordinal)
# Converts categories into integers (0, 1, 2...).
# Useful when the categories have an order.


df = pd.DataFrame({'Quality': ['Low', 'Medium', 'High', 'Medium']})

# Define order manually
quality_order = {'Low': 0, 'Medium': 1, 'High': 2}
df['Quality_encoded'] = df['Quality'].map(quality_order)
print(df)

# Data has ranking or levels (Low < Medium < High).

  Quality  Quality_encoded
0     Low                0
1  Medium                1
2    High                2
3  Medium                1

In [11]:
# One-Hot Encoding (Nominal)
# Creates separate binary columns for each category.
# Use when the categories have no natural order.


df = pd.DataFrame({'Color': ['Red', 'Blue', 'Green', 'Red']})

# One-hot encode
df_encoded = pd.get_dummies(df, columns=['Color'])
print(df_encoded)

# Use this when:
# Categories are nominal (e.g., "Red", "Green", "Blue")
# You want to avoid misleading numeric relationships

   Color_Blue  Color_Green  Color_Red
0       False        False       True
1        True        False      False
2       False         True      False
3       False        False       True

In [13]:
# Binary Encoding / Hashing (Advanced)
# Used for high-cardinality columns (like city names, user IDs).
# Not needed in most beginner/intermediate cases.

df = pd.DataFrame({
    'Weather': ['Sunny', 'Rainy', 'Cloudy', 'Sunny'],
    'Speed': [450, 420, 430, 460]
})

# One-hot encode 'Weather'
df_encoded = pd.get_dummies(df, columns=['Weather'])
print(df_encoded)

   Speed  Weather_Cloudy  Weather_Rainy  Weather_Sunny
0    450           False          False           True
1    420           False           True          False
2    430            True          False          False
3    460           False          False           True

In [5]:
# Normalize / Scale Data
# Normalize / Scale Data refers to transforming numerical features so that they’re on the same scale

# Common Methods:
# Min-Max Scaling (scales values between 0 and 1)
# Standardization (mean = 0, std = 1)


# Why Normalize or Scale?
# If you have:
    # Feature	      Range
    # Speed	          300 – 800 km/s
    # Density	      0.5 – 10 n/cc

# Then Speed will dominate over Density in distance-based algorithms. Scaling puts them on equal footing.

# Min-Max Scaling (Normalization)

df = pd.DataFrame({
    'Speed': [300, 400, 500, 600],
    'Density': [1.0, 2.5, 4.0, 8.0]
})

# Min-max normalization using pandas
df_scaled = (df - df.min()) / (df.max() - df.min())
print(df_scaled)



# Standardization (Z-score scaling)

# Z-score normalization using pandas
df_standardized = (df - df.mean()) / df.std()
print(df_standardized)

      Speed   Density
0  0.000000  0.000000
1  0.333333  0.214286
2  0.666667  0.428571
3  1.000000  1.000000
      Speed   Density
0 -1.161895 -0.955023
1 -0.387298 -0.456750
2  0.387298  0.041523
3  1.161895  1.370250

In [11]:
# Using- sklearn

from sklearn.preprocessing import MinMaxScaler, StandardScaler

df = pd.DataFrame({
    'Speed': [300, 400, 500, 600],
    'Density': [1.0, 2.5, 4.0, 8.0]
})

# Min-Max Scaling
scaler = MinMaxScaler()
scaled_df = pd.DataFrame(scaler.fit_transform(df), columns=df.columns)

# Standardization
scaler = StandardScaler()
standard_df = pd.DataFrame(scaler.fit_transform(df), columns=df.columns)
print(standard_df)

      Speed   Density
0 -1.341641 -1.102766
1 -0.447214 -0.527410
2  0.447214  0.047946
3  1.341641  1.582229

In [ ]:
# Remove Outliers

# Methods:
# Z-score filtering
# IQR (Interquartile Range) filtering
# Manual thresholding



# Example: Z-score

from scipy import stats

z_scores = np.abs(stats.zscore(df))
filtered_df = df[(z_scores < 3).all(axis=1)]  # Keep only rows with z-score < 3


# IQR method


Q1 = df['Speed'].quantile(0.25)
Q3 = df['Speed'].quantile(0.75)
IQR = Q3 - Q1
filtered_df = df[(df['Speed'] >= Q1 - 1.5*IQR) & (df['Speed'] <= Q3 + 1.5*IQR)]